code-review/NRB_3471_3546/База_Было/InformationRegisters/ЦенныеБумагиВЗапросеКотировок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЦенныеБумагиВЗапросеКотировок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ISIN</Name>
					<Comment>ISIN</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаВнесенияВСписок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СозданоАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/InformationRegisters/ЦенныеБумагиВЗапросеКотировок/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьДатуВнесенияВСписок = Не ЗначениеЗаполнено(Запись.ДатаВнесенияВСписок) Или Не ЗначениеЗаполнено(Параметры.Ключ);
	Если УстановитьДатуВнесенияВСписок Тогда
		Запись.ДатаВнесенияВСписок = ТекущаяДатаСеанса();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Параметры.Ключ.Пустой() Тогда
		Запись.СозданоАвтоматически = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаСервере
Процедура ЦеннаяБумагаПриИзмененииНаСервере()
	Запись.ISIN = Запись.ЦеннаяБумага.ISIN;
КонецПроцедуры

&НаКлиенте
Процедура ЦеннаяБумагаПриИзменении(Элемент)
	ЦеннаяБумагаПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти
